const color = `#ffb3a7
#ed5736
#f00056
#f47983
#db5a6b
#f20c00
#c93756
#f05654
#ff2121
#8c4356
#c83c23
#9d2933
#ff4c00
#ff4e20
#f35336
#cb3a56
#ff2d51
#c91f37
#ef7a82
#ff0097
#ff3300
#c3272b
#a98175
#c32136
#b36d61
#be002f色。
#dc3023
#f9906f
#fff143
#faff72
#eaff56
#ffa631
#ff8c31
#ff8936
#ffa400
#ff7500
#ffc773
#f0c239
#fa8c35
#b35c44
#a88462
#c89b40
#60281e
#b25d25
#827100
#7c4b00
#9b4400
#ae7000
#9c5333
#955539
#ca6924
#6e511e
#d3b17d
#e29c45
#896c39
#d9b611
#bddd22
#c9dd22
#afdd22
#789262
#a3d900
#9ed900
#0eb83a 	      ████  葱青：淡淡的青绿色
rgb(14, 184, 58)	#0eb83a 	      ████  葱倩：青绿色
rgb(10, 163, 68)	#0aa344 	      ████  青葱：翠绿色,形容植物浓绿
rgb(0, 188, 18)	#00bc12 	      ████  油绿：光润而浓绿的颜色。以上几种绿色都是明亮可爱的色彩。
rgb(12, 137, 24)	#0c8918 	      ████  绿沈（沉）：深绿
rgb(27, 209, 165)	#1bd1a5 	      ████  碧色：1，青绿色。2，青白色,浅蓝色。
rgb(42, 221, 156)	#2add9c 	      ████  碧绿：鲜艳的青绿色
rgb(72, 192, 163)	#48c0a3 	      ████  青碧：鲜艳的青蓝色
rgb(61, 225, 173)	#3de1ad 	      ████  翡翠色：1，翡翠鸟羽毛的青绿色。2，翡翠宝石的颜色。（quester注：C-Y≥30 的系列色彩，多与白色配合以体现清新明丽感觉，与黑色配合效果不好：该色个性柔弱，会被黑色牵制）
rgb(64, 222, 90)	#40de5a 	      ████  草绿：绿而略黄的颜色。
rgb(0, 224, 158)	#00e09e 	      ████  青色：1，一类带绿的蓝色,中等深浅,高度饱和。3，本义是蓝色。4，一般指深绿色。5，也指黑色。6，四色印刷中的一色。2，特指三补色中的一色。
rgb(0, 224, 121)	#00e079 	      ████  青翠：鲜绿
rgb(192, 235, 215)	#c0ebd7 	      ████  青白：白而发青,尤指脸没有血色
rgb(224, 238, 232)	#e0eee8 	      ████  鸭卵青：淡青灰色，极淡的青绿色
rgb(187, 205, 197)	#bbcdc5 	      ████  蟹壳青：深灰绿色
rgb(66, 76, 80)	#424c50 	      ████  鸦青：鸦羽的颜色。即黑而带有紫绿光的颜色。
rgb(0, 229, 0)	#00e500 	      ████  绿色：1，在光谱中介于蓝与黄之间的那种颜色。2，本义：青中带黄的颜色。3，引申为黑色，如绿鬓：乌黑而光亮的鬓发。代指为青春年少的容颜。（quester注：现代色彩研究中，把绿色提高到了一个重要的位置，和其它红黄兰三原色并列研究，称做"心理原色"之一）
rgb(158, 208, 72)	#9ed048 	      ████  豆绿：浅黄绿色
rgb(150, 206, 84)	#96ce54 	      ████  豆青：浅青绿色
rgb(123, 207, 166)	#7bcfa6 	      ████  石青：淡灰绿色
rgb(46, 223, 163)	#2edfa3 	      ████  玉色:玉的颜色，高雅的淡绿、淡青色
rgb(127, 236, 173)	#7fecad 	      ████  缥：绿色而微白
rgb(164, 226, 198)	#a4e2c6 	      ████  艾绿：艾草的颜色。偏苍白的绿色。
rgb(33, 166, 117)	#21a675 	      ████  松柏绿：经冬松柏叶的深绿
rgb(5, 119, 72)	#057748 	      ████  松花绿：亦作"松花"、"松绿"。偏黑的深绿色,墨绿。
rgb(188, 230, 114)	#bce672 	      ████  松花色：浅黄绿色。（松树花粉的颜色）《红楼梦》中提及松花配桃红为娇艳

蓝色系
rgb(68, 206, 246)	#44cef6 	      ████  蓝：三原色的一种。像晴天天空的颜色（quester注：这里的蓝色指的不是RGB色彩中的B，而是CMY色彩中的C）
rgb(23, 124, 176)	#177cb0 	      ████  靛青：也叫"蓝靛"。用蓼蓝叶泡水调和与石灰沉淀所得的蓝色染料。呈深蓝绿色（quester注：靛，发音dian四声，有些地方将蓝墨水称为"靛水"或者"兰靛水"）
rgb(6, 82, 121)	#065279 	      ████  靛蓝：由植物(例如靛蓝或菘蓝属植物)得到的蓝色染料
rgb(62, 237, 231)	#3eede7 	      ████  碧蓝：青蓝色
rgb(112, 243, 255)	#70f3ff 	      ████  蔚蓝：类似晴朗天空的颜色的一种蓝色
rgb(75, 92, 196)	#4b5cc4 	      ████  宝蓝：鲜艳明亮的蓝色（quester注：英文中为 RoyalBlue 即皇家蓝色，是皇室选用的色彩，多和小面积纯黄色（金色）配合使用。）
rgb(161, 175, 201)	#a1afc9 	      ████  蓝灰色：一种近于灰略带蓝的深灰色
rgb(46, 78, 126)	#2e4e7e 	      ████  藏青：蓝而近黑
rgb(59, 46, 126)	#3b2e7e 	      ████  藏蓝：蓝里略透红色
rgb(74, 66, 102)	#4a4266 	      ████  黛：青黑色的颜料。古代女子用以画眉。
rgb(74, 66, 102)	#4a4266 	      ████  黛螺：绘画或画眉所使用的青黑色颜料，代指女子眉妩。
rgb(74, 66, 102)	#4a4266 	      ████  黛色：青黑色。
rgb(66, 102, 102)	#426666 	      ████  黛绿：墨绿。
rgb(66, 80, 102)	#425066 	      ████  黛蓝：深蓝色
rgb(87, 66, 102)	#574266 	      ████  黛紫：深紫色
rgb(141, 75, 187)	#8d4bbb 	      ████  紫色：蓝和红组成的颜色。古人以紫为祥瑞的颜色。代指与帝王、皇宫有关的事物。
rgb(129, 84, 99)	#815463 	      ████  紫酱：浑浊的紫色
rgb(129, 84, 118)	#815476 	      ████  酱紫：紫中略带红的颜色
rgb(76, 34, 27)	#4c221b 	      ████  紫檀：檀木的颜色，也称乌檀色 乌木色
rgb(0, 51, 113)	#003371 	      ████  绀青 绀紫：纯度较低的深紫色
rgb(86, 0, 79)	#56004f 	      ████  紫棠：黑红色
rgb(128, 29, 174)	#801dae 	      ████  青莲：偏蓝的紫色
rgb(76, 141, 174)	#4c8dae 	      ████  群青：深蓝色
rgb(176, 164, 227)	#b0a4e3 	      ████  雪青：浅蓝紫色
rgb(204, 164, 227)	#cca4e3 	      ████  丁香色：紫丁香的颜色，浅浅的紫色，很娇柔淡雅的色彩
rgb(237, 209, 216)	#edd1d8 	      ████  藕色：浅灰而略带红的颜色
rgb(228, 198, 208)	#e4c6d0 	      ████  藕荷色：浅紫而略带红的颜色

苍色
rgb(117, 135, 138)	#75878a 	      ████  苍色：即各种颜色掺入黑色后的颜色，如
rgb(81, 154, 115)	#519a73 	      ████  苍翠
rgb(162, 155, 124)	#a29b7c 	      ████  苍黄
rgb(115, 151, 171)	#7397ab 	      ████  苍青
rgb(57, 82, 96)	#395260 	      ████  苍黑
rgb(209, 217, 224)	#d1d9e0 	      ████  苍白（quester注：准确的说是掺入不同灰度级别的灰色）

水色
rgb(136, 173, 166)	#88ada6 	      ████  水色
rgb(243, 211, 231)	#f3d3e7 	      ████  水红
rgb(212, 242, 231)	#d4f2e7 	      ████  水绿
rgb(210, 240, 244)	#d2f0f4 	      ████  水蓝
rgb(211, 224, 243)	#d3e0f3 	      ████  淡青
rgb(48, 223, 243)	#30dff3 	      ████  湖蓝
rgb(37, 248, 203)	#25f8cb 	      ████  湖绿，皆是浅色。 深色淡色：颜色深的或浅的，不再一一列出。

灰白色系
rgb(255, 255, 255)	#ffffff	      ████  精白：纯白，洁白，净白，粉白。
rgb(255, 251, 240)	#fffbf0	      ████  象牙白：乳白色
rgb(240, 252, 255)	#f2fdff	      ████  雪白：如雪般洁白
rgb(214, 236, 240)	#d6ecf0	      ████  月白：淡蓝色
rgb(242, 236, 222)	#f2ecde	      ████  缟：白色
rgb(224, 240, 233)	#e0f0e9	      ████  素：白色，无色
rgb(243, 249, 241)	#f3f9f1	      ████  荼白：如荼之白色
rgb(233, 241, 246)	#e9f1f6	      ████  霜色：白霜的颜色。
rgb(194, 204, 208)	#c2ccd0	      ▓▓▓▓  花白：白色和黑色混杂的。斑白的 夹杂有灰色的白
rgb(252, 239, 232)	#fcefe8	      ████  鱼肚白：似鱼腹部的颜色，多指黎明时东方的天色颜色（quester注：M5 Y5）
rgb(227, 249, 253)	#e3f9fd	      ████  莹白：晶莹洁白
rgb(128, 128, 128)	#808080	      ████  灰色：黑色和白色混和成的一种颜色
rgb(238, 222, 176)	#eedeb0	      ████  牙色：与象牙相似的淡黄色（quester注：暖白）
rgb(240, 240, 244)	#f0f0f4	      ████  铅白：铅粉的白色。铅粉，国画颜料，日久易氧化"返铅"变黑。铅粉在古时用以搽脸的化妆品。（quester注：冷白）

黑色系
rgb(98, 42, 29)	#622a1d	      ████  玄色：赤黑色，黑中带红的颜色，又泛指黑色
rgb(61, 59, 79)	#3d3b4f	      ████  玄青：深黑色
rgb(114, 94, 130)	#725e82	      ████  乌色：暗而呈黑的颜色
rgb(57, 47, 65)	#392f41	      ████  乌黑：深黑；漆黑
rgb(22, 24, 35)	#161823	      ████  漆黑：非常黑的
rgb(80, 97, 109)	#50616d	      ████  墨色：即黑色
rgb(117, 138, 153)	#758a99	      ████  墨灰：即黑灰
rgb(0, 0, 0)	#000000	      ████  黑色：亮度最低的非彩色的或消色差的物体的颜色；最暗的灰色；与白色截然不同的消色差的颜色；被认为特别属于那些既不能反射、又不能透过能使人感觉到的微小入射光的物体,任何亮度很低的物体颜色。
rgb(73, 49, 49)	#493131	      ████  缁色：帛黑色
rgb(49, 37, 32)	#312520	      ████  煤黑、象牙黑：都是黑，不过有冷暖之分。
rgb(93, 81, 60)	#5d513c	      ████  黧：黑中带黄的颜色
rgb(117, 102, 77)	#75664d	      ████  黎：黑中带黄似黎草色
rgb(107, 104, 130)	#6b6882	      ████  黝：本义为淡黑色或微青黑色。
rgb(102, 87, 87)	#665757	      ████  黝黑：（皮肤暴露在太阳光下而晒成的）青黑色
rgb(65, 85, 93)	#41555d	      ████  黯：深黑色、泛指黑色

金银色
rgb(242, 190, 69)	#f2be45	      ████  赤金：足金的颜色
rgb(234, 205, 118)	#eacd76	      ████  金色：平均为深黄色带光泽的颜色
rgb(233, 231, 239)	#e9e7ef	      ████  银白：带银光的白色
rgb(84, 150, 136)	#549688	      ████  铜绿
rgb(167, 142, 68)	#a78e44	      ████  乌金
rgb(186, 202, 198)	#bacac6
`
let data =[]
for (let i = 0; i <color.length;i++){
 if (color[i]==='#'){
   data.push(color.slice(i,i+7))
   console.log(`'${color.slice(i,i+7)}',`)
 }
}


// console.log(data)
